project03/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "5"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 04 Feb 2012 22:02:56 UTC +00:00], ["updated_at", Sat, 04 Feb 2012 22:02:56 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 20], ["created_at", Sun, 05 Feb 2012 21:38:01 UTC +00:00], ["order_id", nil], ["product_id", 5], ["quantity", 1], ["updated_at", Sun, 05 Feb 2012 21:38:01 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-02-05 11:46:39.589527' WHERE "line_items"."id" = 8
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save