project03/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "products" SET "description" = '<p>Ruby is so awesome, I can barely breathe</p>', "updated_at" = '2012-01-30 05:08:11.411539' WHERE "products"."id" = 3
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
---
  def who_bought # atom feeds
    @product = Product.find(params[:id])