project03/app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 4
---
	</tr>
	<% @cart.line_items.each do |item| %>